import NewApp from "@assets/new-app.png";
import FreshNews from "@assets/fresh-news.png";
import { NewsItem } from "@models";

export async function getNews(): Promise<NewsItem[]> {
  return [
    {
      id: "1",
      image: FreshNews,
      title: "Новини червня",
      text: "Оскільки літнє сонце світить яскраво, Scan&Shop Grocery Store готується зробити червень місяцем неймовірних покупок. Зосереджуючись на зручності, якості та інноваціях, ця улюблена мережа супермаркетів готова пропонувати своїм клієнтам безліч цікавих новин і оновлень. Від запуску нових продуктів до покращених послуг, Scan&Shop прагне зробити покупки продуктів легкими для кожного. Оновлення програми Scan&Shop: У червні Scan&Shop випускає довгоочікуване оновлення свого мобільного додатку. Додаток, створений для спрощення покупки, тепер має розширену навігацію, персоналізовані пропозиції та покращений інтерфейс користувача. Клієнти можуть легко знаходити продукти, створювати списки покупок і отримувати доступ до знижок у реальному часі, забезпечуючи безперебійну подорож до покупки від початку до кінця. Розширений розділ органічних та місцевих продуктів: Розуміючи зростаючий попит на органічні та місцеві продукти, Scan&Shop цього червня розширює розділ органічних та місцевих продуктів. Покупці можуть розраховувати на широкий вибір свіжих фруктів, овочів і трав, вирощених місцевими фермерами. Цей крок, зосереджений на стійкому розвитку та підтримці спільноти, посилює прагнення Scan&Shop пропонувати своїм клієнтам більш здоровий та екологічно чистий вибір. Представлення програми Scan&Shop Rewards: Щоб висловити вдячність своїм постійним клієнтам, у червні Scan&Shop запроваджує абсолютно нову програму винагород. Реєструючись у програмі, покупці можуть заробляти бали за свої покупки, які можна обміняти на ексклюзивні знижки, безкоштовні продукти або навіть благодійні пожертви. Програма винагород спрямована на покращення досвіду покупок, надаючи клієнтам додаткову цінність і розвиваючи почуття спільності. Набори їжі Scan&Shop: Виводячи приготування їжі на новий рівень, Scan&Shop запускає власну лінійку зручних і смачних наборів їжі. У цих наборах будуть рецепти, розроблені шеф-кухарем, із попередньо порційованими інгредієнтами, що полегшить приготування вишуканих страв вдома, ніж будь-коли. Завдяки різноманітним варіантам, які відповідають різним дієтичним уподобанням і кулінарним здібностям, набори їжі Scan&Shop ідеально підходять для зайнятих людей і сімей, які шукають безпроблемного приготування їжі. Розширена служба онлайн-замовлень і доставки: У відповідь на зростання популярності онлайн-покупок продуктів Scan&Shop розширює послуги онлайн-замовлень і доставки. Тепер клієнти можуть насолоджуватися зручністю перегляду та покупки своїх продуктів, не виходячи з дому. Завдяки зручному інтерфейсу, гнучким термінам доставки та уважному обслуговуванню клієнтів Scan&Shop гарантує, що клієнти отримають свої замовлення швидко та з максимальною ретельністю. висновок: Червень обіцяє бути захоплюючим місяцем для покупців продуктового магазину Scan&Shop. Завдяки впровадженню нових функцій, покращеним послугам і прихильності до якості Scan&Shop продовжує змінювати досвід покупки продуктів. Незалежно від зручності мобільного додатку, наявності органічних і місцевих продуктів, запуску програми винагород, впровадження наборів їжі чи розширення онлайн-замовлень і служби доставки, Scan&Shop прагне надавати своїм клієнтам неперевершена зручність, різноманітність і задоволення. Тож відзначайте свої календарі та готуйтеся до незабутніх покупок у Scan&Shop цього червня!",
      date: "04.06.2023",
    },
    {
      id: "2",
      image: NewApp,
      title: "Новий додаток",
      text: 'Інтернет-магазин продуктів запускає новий мобільний додаток "Scan & Shop"! Тепер наші клієнти можуть отримати ще більше зручності та швидкості під час здійснення покупок. Додаток дозволяє сканувати штрих-коди продуктів за допомогою камери смартфону та зручно додавати їх до кошика. Крім того, за допомогою функції пошуку користувачі можуть знайти необхідні продукти за назвою або категорією.',
      date: "01.01.2023",
    },
  ];
}
